{
  "Projects": [
        {
          "Title": "ye",
          "Content": "A cli for fetching Kanye West quotes. I learned a bit more about using aync await in rust with the tokyo crate, and I used serde, a crate to convert different types of data formatting, so that I could convert json to an instance of a rust struct. This was made with the kanye.rest api.",
          "Buttons": [
            {
              "ButtonClass": "GitHub",
              "ButtonHref": "https://github.com/sempruijs/ye",
              "ButtonText": "View on github"
            }
          ],
          "Tags": "rust, github, cli, api, serde, tokyo"
        },
        {
          "Title": "justhas",
          "Content": "A simple cli for generating sha256 hashes.",
          "Buttons": [
            {
              "ButtonClass": "GitHub",
              "ButtonHref": "https://github.com/sempruijs/justhash",
              "ButtonText": "View on github"
            }
          ],
          "Tags": "rust, github, cli"
        },
        {
        "Title": "new read",
        "Content": "new-read is a new way of spelling dutch words so people with dyslexia can't write words the wrong way anymore. This is done by eliminating different ways to write the same sound. The nrc (new read converter) is wirtten in rust and I made a super small sort of language to define string convertions. I also used clap (command line argument parser) a rust crate to generate nice help menus for the cli.",
        "Buttons": [
          {
            "ButtonClass": "GitHub",
            "ButtonHref": "https://github.com/sempruijs/new-read",
            "ButtonText": "View on github"
          }
        ],
        "Tags": "rust, github, cli"
      },
      {
        "Title": "randaam cli",
        "Content": "It was time to use rust in my own projects. Randaam, the app that I mad when I was little as a command-line intervace. I published a crate on crates.io for the first time and written some documentation so people could read it on docs.rs",
        "Buttons": [
          {
            "ButtonClass": "GitHub",
            "ButtonHref": "https://github.com/sempruijs/randaam-cli",
            "ButtonText": "View on github"
          }
        ],
        "Tags": "rust, github, cli"
      },
      {
        "Title": "The Rust programming language",
        "Content": "As I learned from ka.pruijs.net and using javascript, error messages are very important, especially when you have a visual imperment. I've heard from other people that rust has amazing error messages and is becoming very populair because of its spead and safety. So I decided to learn the language mainly because of those error messages and its very strict type system which is also very important for a language when you have a visual imperment. Debugging is slower when you do not see that much, so not having to figure out what value what type is is a big plus. I read it from start to finish, and as I read more of the book, my sight became a bit better so I switched to Helix, which is a editor with vim-key bindings. I think I know rust the best of all languages that I used so far and it has become one of my favorites.",
        "Buttons": [
          {
            "ButtonClass": "GitHub",
            "ButtonHref": "https://github.com/sempruijs/learn-rust",
            "ButtonText": "View on github"
          }
        ],
        "Tags": "rust, github, book"
      },
      {
        "Title": "Contributing to open source",
        "Content": "I did a few small cuntributions to element X for ios, element X is a matrix client, and made issues and small pull requests here and there. I learned the whole process of forking a repository, making changes on a branch and reading the contribution guidelines. I learned allot from contributing to open source, my main concern regarding my visual imperment, was if I was capable enough to collaborate with other people and reading allot of code that other people have wirtten. When I started it was pretty hard, but with enough practice was it possible and now I do not find it so hard anymore. I will keep contributing to open source to make software more accessible. You can look at my github to explore the places where my contributions are",
        "Buttons": [
          {
            "ButtonClass": "GitHub",
            "ButtonHref": "https://github.com/sempruijs",
            "ButtonText": "View on github"
          }
        ],
        "Tags": "swift, github, nix, element, matrix"
      },
      {
        "Title": "PAKS",
        "Content": "A website where you can drum simple rythms that also has great intergration with braille displays. I did not learn anything new except a bit with html textfields, I used the skills that I had learned from ka and made something new. It was nice to see that visual and non visual people could drum a rithm together",
        "Buttons": [
          {
            "ButtonClass": "GitHub",
            "ButtonHref": "https://github.com/SemPruijs/paks",
            "ButtonText": "View on github"
          },
          {
            "ButtonClass": "Browser",
            "ButtonHref": "https://paks.pruijs.net",
            "ButtonText": "View paks.pruijs.net in the browser"
          }
        ],
        "Tags": "website, browser, typescript, html, css, github, nix, ci/cd, vip"
      },
      {
      "Title": "kenmerkende aspecten",
      "Content": "Maybe this is one of my greatest accomplishments. I learned to program without my vision, and navigating my computer just with a screen-reader. But I learned one other important thing too! Never use javascript period. Because of my visual imparement, if you would see \"object is undifined\", you could figure out what the bug is if you stare a bit. (when your lucky) But when I lost my vission this was horrible! I had to read every sentence in my script with braille to figure out where that one copital letter is that jambels it all up. So, I learned typescript. With typescript the compiler should me the bug. But I wanted to deploy my site so I learned about CI/CD. My brother is a big Nix fan so he encouraged me to make my build process reproducable with a Nix flake. I learned more about dev-shells and configured MacOS with Nix Darwin and the home-manager. The website is not that impresive, it helps you remembering dutch historical facts, but this is the first project that was succesful when trying to develop with my visual imperment, makes me feel very happy about ka.pruijs.net",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "https://github.com/SemPruijs/ka",
          "ButtonText": "View on github"
        },
        {
          "ButtonClass": "Browser",
          "ButtonHref": "https://ka.pruijs.net",
          "ButtonText": "View ka.pruijs.net in the browser"
        }
      ],
      "Tags": "website, browser, typescript, html, css, github, nix, ci/cd, vip"
    },
    {
      "Title": "learn you a haskell for great good",
      "Content": "This is an introduction to Haskell. A functional programming language. Do I never read it from start to finish, haskell influenced me so much that I try in every language to write only pure functions and elliminate state as much as possible. Pure functions are the way to move forward and in almost all cases (not games) is writing only pure functions the best long-term approach for a project.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "https://github.com/SemPruijs/ka",
          "ButtonText": "View on github"
        },
        {
          "ButtonClass": "Browser",
          "ButtonHref": "https://ka.pruijs.net",
          "ButtonText": "View ka.pruijs.net in the browser"
        }
      ],
      "Tags": "website, browser, typescript, html, css, github, nix, ci/cd, vip"
    },
    {
      "Title": "Randaam Web",
      "Content": "This is randaam, but made for the browser. This is so much easier than making an app in UIKit. I learned how to make my own type in javascript and how to implement dark mode to a website with system theme.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "https://github.com/SemPruijs/randaamWeb",
          "ButtonText": "View on github"
        },
        {
          "ButtonClass": "Browser",
          "ButtonHref": "https://randaam.pizzagezond.nl/",
          "ButtonText": "View Randaam in browser"
        }
      ],
      "Tags": "website, browser, javascript, html, css, github"
    },
    {
      "Title": "pizzagezond.nl",
      "Content": "This was a joke website. The website literally says pizza is healthy in dutch. I learned how to set up a custom domain with github pages. I also made my first animation with css.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "https://github.com/SemPruijs/pizzagezond.nl",
          "ButtonText": "View on github"
        },
        {
          "ButtonClass": "Browser",
          "ButtonHref": "https://pizzagezond.nl/",
          "ButtonText": "View in browser"
        }
      ],
      "Tags": "joke, pizza, css, html, website, pixelart, github"
    },
    {
      "Title": "The Space",
      "Content": "The space is a game that I made in 5 days for a game jam. I learned how to use the tiles system in unity and I got more experience of making pixel art. A friend made the monster sprites. The theme was lost in space, so I thought about a game where children are lost in a space. The game is a bit buggy but I am happy with the end result.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "https://github.com/SemPruijs/TheSpace",
          "ButtonText": "View on github"
        },
        {
          "ButtonClass": "Browser",
          "ButtonHref": "https://sempruijs.itch.io/thespace",
          "ButtonText": "View in browser"
        }
      ],
      "Tags": "game, game jam, browser, unity, c#, pixel art, pixelart, github"
    },
    {
      "Title": "Advent of code 2020",
      "Content": "Advent of code 2020 is a competition where you have to solve puzzles. I thought that python was a great language to use and it was. I now know python better. Sadly, I didn't finish it to christmas. I really enjoyed the challenges, but they where just too long for my routine. School has top priority for me. I do not think I will compete next year because the challenges cost just too much time for me. Maybe if advent of code mini comes out or something similar like that.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "https://github.com/SemPruijs/AdventOfCode2020",
          "ButtonText": "View on github"
        }
      ],
      "Tags": "python"
    },
    {
        "Title": "Pypong",
        "Content": "Pong made with python. I always wanted to learn python and make pong so I thought let's do it now. I made it with turtle in one night. Python was a very simple language and for small projects like these it's perfect. I enjoyed the process although it was short.",
        "Buttons": [
          {
            "ButtonClass": "GitHub",
            "ButtonHref": "https://github.com/SemPruijs/pypong",
            "ButtonText": "View on github"
          }
        ],
      "Tags": "python, game, practice, github"
     },

    {
      "Title": "Rainbowglow",
      "Content": "Rainbowglow is a game that I made in 30 minutes. It's hard to make a game in that short of a time period but I was up to a challenge. The game is trash but for 30 minutes it is good in my opinion. I think it is a good concept so I may turn it into a polished mobile game one day. Made with unity and fast game",
      "Buttons": [
        {
          "ButtonClass": "Browser",
          "ButtonHref": "https://sempruijs.github.io/rainbowglow/",
          "ButtonText": "View in browser"
        }
      ],
      "Tags": "game, unity, c#, browser, website"
    },

    {
        "Title": "Music Share Hub",
        "Content": "Music Share Hub (I know it's not the best name) is a little project that I made for sharing music. I found myself repeating an action over and over. It was thinking about: \"On which platform does person x listen music?\" Was it on spotify? or on youtube? So I made a website where you can type the name of a song in a text-field, and the links would generate automatically. The input was stored in the url so you could send that to your friends. And when your friend opens the url, they can decide for them self. It was pretty easy to make, but I did learn a few small things. Storing information in a url and styling a text-field. I was very happy that I could program, because I could solve a problem that I had with my programming skills",
        "Buttons": [
          {
            "ButtonClass": "GitHub",
            "ButtonHref": "https://github.com/SemPruijs/MusicShareHub",
            "ButtonText": "View on github"
          },
          {
            "ButtonClass": "Browser",
            "ButtonHref": "https://sempruijs.github.io/MusicShareHub/",
            "ButtonText": "View in browser"
          }
        ],
      "Tags": "html, css, javascript, js, website, browser, github"
     },

    {
      "Title": "Relaxed Legs",
      "Content": "A endless runner that I made on my own. I learned a few things that are important for game development. I worked on it alone from start to finish. I did the appstore connect uploading all on my own and I made my first Apple Tv and my first Mac application and uploaded them on the app store. I really enjoyed seeing my app on the Apple tv because the screen is so much bigger than a phone. I didn't spent to much time on it because it was not a \"new\" concept but I did finish it to the end which felt very rewarding.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "https://github.com/SemPruijs/RelaxedLegs",
          "ButtonText": "View on github"
        },
        {
          "ButtonClass": "AppStore",
          "ButtonHref": "https://apps.apple.com/us/app/relaxed-legs/id1525586149",
          "ButtonText": "View on the App Store"
        },
        {
          "ButtonClass": "Browser",
          "ButtonHref": "https://sempruijs.github.io/RelaxedLegsHosting/",
          "ButtonText": "View in browser"
        }
      ],
      "Tags": "game, unity, c#, browser, appstore, app store, ios, apple tv, macos, ipados, github, gamecenter, website"
    },

    {
      "Title": "sempruijs.nl",
      "Content": "This website. I want to learn more about web technologies so I thought this website would be a great practice. I first tried to make a website with html and css and it was very easy to do that. The problem was that the scope was to big so I did it again but with a much smaller scope. I wanted to learn more about JavaScript so I learned how to load a .json file and creating html elements with information from the json file. I learned a little bit of JavaScript, how json works and I really like the whole process of making a website because you get fast results.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "http://github.com/sempruijs/sempruijs.nl",
          "ButtonText": "View on github"
        }
      ],
      "Tags": "html, css, javascript, json, website, js, github"
    },

    {
      "Title": "One Hour Game Jam",
      "Content": "I participate almost every week in the One Hour Game Jam. I really enjoy making a game in one hour because the results are so bad that it is funny to play the games. I use the fast game project every week and through this game jam I can improve the Fast Game project. I participate in this jam almost every week so there is always something to play there :)",
      "Buttons": [
        {
          "ButtonClass": "Browser",
          "ButtonHref": "https://onehourgamejam.com/?page=author&author=qlpcuber",
          "ButtonText": "View games"
        }
      ],
      "Tags": "game, games, unity, c#, gamejam, game jam, browser, website, 1hgj"
    },

    {
      "Title": "Fast Game",
      "Content": "Fast Game is not a game but a unity 2d projects where you can make games fast. This is made for prototyping and for game jam where you are allowed to use pre made assets and scripts. The projects contains scripts that are easy to use and multifunctional. It also contains art assets that I have made for game jams and for the Fast Game project it self. It also has some music and sound effects for that I made for game jams and for the Fast Game project. When a prototype has to be made, I clone the Git repository and make changes to make to prototype. I do not make the repository public because I do not want people to use my music and sprites. Because of this project I do not have to repeat my self constantly when making games.",
      "Buttons": [
      ],
      "Tags": "tool, unity, c#"
    },

    {
      "Title": "Sem Service",
      "Content": "Sem Service is a candy machine made with an arduino. I want to make something with arduino's and I want to make a little bit of money so this was the perfect project. You can order a candy bar on a website if you're on our internet connection and then you can grab the candy bar out of the machine. My dad made the API from the website to the arduino and I created the machine and I learned with this project allot. How electricity works. How to control the arduino. C++. working with servo's and lots more. I will add photos of the candy machine in the future",
      "Buttons": [
      ],
      "Tags": "hardware, c++, cpp, lego"
    },

    {
      "Title": "Parallel Worlds",
      "Content": "Parallel Worlds was a game made for the HighPixel game jam 1. I had one week to make a game and it was fun to make. I learned more about game jams and that it is important to keep te scope small. You can play the game on itch.io",
      "Buttons": [
        {
          "ButtonClass": "Browser",
          "ButtonHref": "https://sempruijs.itch.io/parallel-worlds",
          "ButtonText": "View game"
        }
      ],
      "Tags": "game, c#, unity, gamejam, game jam, browser, website"
    },

    {
      "Title": "Tankee",
      "Content": "Tankee was my next big project. I wanted to do something with local multiplayer so I thought: Tank battle! I learned allot from this project but i felt like it was not an amazing idea. So I stopped. I worked hard on it and it was fun to play for some people but was not for others. Controls where hard and you needed 2 controllers. I wanted a game that was more accessible and less violent. (That game is Flyght where I am working on right now.)",
      "Buttons": [
        {
          "ButtonClass": "Github",
          "ButtonHref": "https://github.com/SemPruijs/Tankee",
          "ButtonText": "View on github"
        }
      ],
      "Tags": "unity, c#, game, github"
    },

    {
      "Title": "Taptic Engine Test",
      "Content": "I just had a iPhone 7 and I was fascinated by the taptic Engine. I wanted to feel all the feedback things so I made an app in Xcode to test all the haptic feedback things that you could use as developer. It was made under a day I think and later published on GitHub.",
      "Buttons": [
        {
          "ButtonClass": "Github",
          "ButtonHref": "https://gikthub.com/SemPruijs/tapticenginetest",
          "ButtonText": "View on github"
        }
      ],
      "Tags": "app, ios uikit, swift, github"
    },

    {
      "Title": "Mini Parkour",
      "Content": "This is a rage game. I was a bit bored from a big project of mine so I made this project. You can play it on itch.io but please do not break things when you are angry. I learned with this project how to use the animator and how to transition from scene to scene. I really enjoyed seeing people playing that game.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "http://github.com/sempruijs/mini-parkour",
          "ButtonText": "View on github"
        },
        {
          "ButtonClass": "Browser",
          "ButtonHref": "https://sempruijs.itch.io/booshj",
          "ButtonText": "View game"
        }
      ],
      "Tags": "game, hard, browser, unity, c#, github"
    },

    {
      "Title": "Wosta",
      "Content": "Wosta is a game made with Unity and C# and the rules are simple: Eat fish that are smaller then you. Avoid fish that are bigger then you. When you eat a small fish, you grow. Become big. I made this game in collaboration with my dad. I learned allot with this project because of my dad. He showed me how to avoid spaghetti code and write code that is easy to understand. We worked with unity collab and after he stopped paying for that, I put the project on GitHub. I also made some updates to the application. A made a christmas update and a sticker pack for iMessages and a update where you can where hats. I did those updates on my own. I really enjoyed working on this project.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "http://github.com/sempruijs/wosta",
          "ButtonText": "View on github"
        },
        {
          "ButtonClass": "AppStore",
          "ButtonHref": "https://apps.apple.com/us/app/wosta/id1475454482",
          "ButtonText": "View on the App Store"
        }
      ],
      "Tags": "game, c#, unity, app store, appstore, ios, ipados, gamecenter, game center, iphone, ipad, github"
    },

    {
      "Title": "aMAZEing",
      "Content": "I want to make games. But Xcode was not the best way to do so. So I learned the basics of Unity to make this project. It is a maze game. And it has the clever name aMAZEing. I picked up Unity and C# fast. Making something in Xcode is so much harder then in Unity. I think this was made in about 1 or 2 days.",
      "Buttons": [
        {
          "ButtonClass": "Github",
          "ButtonHref": "https://github.com/SemPruijs/aMAZEing",
          "ButtonText": "View on github"
        }
      ],
      "Tags": "game, c#, unity, github"
    },

    {
      "Title": "Tic Tac Pro",
      "Content": "Tic Tac Pro is Tic Tac Toe but then you could play on a 3x3, a 4x4 bord and a 5x5 board. It was time to apply my knowledge from Learn to code 1, 2 and 3 and Intro to App Development with Swift to make an app! My brother said: A great practice to test you skills is to make Tic Tac Toe. It was a great tip from him and I started making Tic Tac Toe. I want to release the app so it had to have a cool feature. A 4x4 board and a 5x5 board. I spend too much time on this feature and when it was done, I came to a conclusion that it was not fun to play on a 4x4 board and a 5x5 board because who begins wins. :( This was painful to see and I learned something very important: PLAY TEST!, I could've just grabbed a piece of paper and test with a friend if this concept was fun to play. I did learn more about programming and writing elegant code.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "http://github.com/sempruijs/tictacpro",
          "ButtonText": "View on github"
        }
      ],
      "Tags": "ios, uikit, swift, github"
    },

    {
      "Title": "Intro to App Development with Swift",
      "Content": "Now that I knew how to program, it was time to learn how I should build an app with Xcode. This was a great book. After a few chapters I was working with Xcode and making simple apps. I completed the book and I had the knowledge on how to build an app.",
      "Buttons": [
      ],
      "Tags": "book, tutorial"
    },

    {
      "Title": "Learn to code 1, 2, 3",
      "Content": "Learn to code 1, 2 and 3 are three programming courses on swift playground on the iPad. After Randaam I thought that I need to know more on how to program. That was a great decision. I really loved the courses and I would recommend it to anyone who wants to know how to program.",
      "Buttons": [
      ],
      "Tags": "book, tutorial"
    },

    {
      "Title": "Randaam",
      "Content": "My dream was making an app for the app store. So I installed Xcode. I followed the first few chapters and I thought I knew enough and started making Randaam. Randaam is a dutch random person generator. It was build with Swift and UIkit. The most important skill was how to google. I knew what I was writing and how to write it but progress was going slow. I think that is because I had too little knowledge about UIkit and programming in general. My dad put the app on the app store with his appstore connect account. It was really fun to make it and I learned ALLOT from it. I am happy that my brother forced me to use git and now the project is on github. :) Later I remade Randaam with swiftUI.",
      "Buttons": [
        {
          "ButtonClass": "GitHub",
          "ButtonHref": "http://github.com/sempruijs/randaam",
          "ButtonText": "View on github"
        },
        {
          "ButtonClass": "AppStore",
          "ButtonHref": "https://apps.apple.com/us/app/randaam/id1347697172",
          "ButtonText": "View on the App Store"
        }
      ],
      "Tags": "ios, iphone, ipad, uikit, swift, swiftui, app, appstore, app store, github"
    },

    {
      "Title": "Scratch game",
      "Content": "My first thing that had something to do with programming was scratch. I made a bird game where you had to avoid other birds. I learned the basics of coding and it was really fun to make it. I think I was 11 or 12. Sadly, I lost cannot find the project on my account anymore :(",
      "Buttons": [
      ],
      "Tags": "game"
    }
  ]
}
